vjezxje/lib_rf_stm32f1/Rf_f4/Core/Inc/nrf24l01.h
/*
------------------------------------------------------------------------------
~ File   : nrf24l01.h
~ Author : Majid Derhambakhsh
~ Version: V1.1.0
~ Created: 01/27/2023 10:00:00 PM
~ Brief  :
~ Support:
           E-Mail : Majid.Derhambakhsh@gmail.com (subject : Embedded Library Support)
           
           Github : https://github.com/Majid-Derhambakhsh
------------------------------------------------------------------------------
~ Description:    

~ Attention  :    This file is for AVR/ARM MCU

~ Changes    :
------------------------------------------------------------------------------
*/

#ifndef __NRF24L01_H_
#define __NRF24L01_H_

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Include ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
#include <stdint.h>

#include "nrf24l01_conf.h"

/* ------------------------------------------------------------------ */
#ifdef _CodeVISIONAVR__  /* Check compiler */

#pragma warn_unref_func- /* Disable 'unused function' warning */

#ifndef __SPI_UNIT_H_
	#include "SPI_UNIT/spi_unit.h"
#endif /* __SPI_UNIT_H_ */

#ifndef __GPIO_UNIT_H_
	#include "GPIO_UNIT/gpio_unit.h"
#endif /* __GPIO_UNIT_H_ */

/* ------------------------------------------------------------------ */
#elif defined(__GNUC__) && !defined(USE_HAL_DRIVER)  /* Check compiler */

#pragma GCC diagnostic ignored "-Wunused-function" /* Disable 'unused function' warning */

#ifndef __SPI_UNIT_H_
	#include "SPI_UNIT/spi_unit.h"
#endif /* __SPI_UNIT_H_ */

#ifndef __GPIO_UNIT_H_
	#include "GPIO_UNIT/gpio_unit.h"
#endif /* __GPIO_UNIT_H_ */

/* ------------------------------------------------------------------ */
#elif defined(USE_HAL_DRIVER)  /* Check driver */

	#if LCD_USE_FREE_RTOS == 1
		#include "cmsis_os.h"
	#endif /* _LCD_USE_FREE_RTOS */
	
	/* --------------- Check Mainstream series --------------- */
	#ifdef STM32F0
		#include "stm32f0xx_hal.h"       /* Import HAL library */
	#elif defined(STM32F1)
		#include "stm32f1xx_hal.h"       /* Import HAL library */
	#elif defined(STM32F2)
		#include "stm32f2xx_hal.h"       /* Import HAL library */
	#elif defined(STM32F3)
		#include "stm32f3xx_hal.h"       /* Import HAL library */
	#elif defined(STM32F4)
		#include "stm32f4xx_hal.h"       /* Import HAL library */
	#elif defined(STM32F7)
		#include "stm32f7xx_hal.h"       /* Import HAL library */
	#elif defined(STM32G0)
		#include "stm32g0xx_hal.h"       /* Import HAL library */
	#elif defined(STM32G4)
		#include "stm32g4xx_hal.h"       /* Import HAL library */
	
	/* ------------ Check High Performance series ------------ */
	#elif defined(STM32H7)
		#include "stm32h7xx_hal.h"       /* Import HAL library */
	
	/* ------------ Check Ultra low power series ------------- */
	#elif defined(STM32L0)
		#include "stm32l0xx_hal.h"       /* Import HAL library */
	#elif defined(STM32L1)
		#include "stm32l1xx_hal.h"       /* Import HAL library */
	#elif defined(STM32L5)
		#include "stm32l5xx_hal.h"       /* Import HAL library */
	#elif defined(STM32L4)
		#include "stm32l4xx_hal.h"       /* Import HAL library */
	#elif defined(STM32H7)
		#include "stm32h7xx_hal.h"       /* Import HAL library */
	#else
	#endif /* STM32F1 */
	
	/* ------------------------------------------------------- */
	#if defined(__ICCARM__) /* ICCARM Compiler */
	
		#pragma diag_suppress=Pe177   /* Disable 'unused function' warning */
		
	#elif defined(__GNUC__) /* GNU Compiler */
	
		#pragma diag_suppress 177     /* Disable 'unused function' warning */
		
	#endif /* __ICCARM__ */

/* ------------------------------------------------------------------ */
#else                     /* Compiler not found */

#error Chip or Library not supported  /* Send error */

#endif /* _CodeVISIONAVR__ */

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Defines ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/* ------------------------------ NRF ------------------------------ */
/* .................... Radio ..................... */
#define NRF24L01_BASE_CHANNEL_MHZ 2400

/* Addresses */
#define NRF24L01_ADDRESS_WIDTH    5

#define NRF24L01_REG_RX_ADDR_P0_P5_DEF 0xE7

/* .................... Common .................... */
/* ................... Macro's .................... */
#define __NRF24L01_SET_BIT(REG, BIT)     ((REG) |= (1 << (BIT)))
#define __NRF24L01_RESET_BIT(REG, BIT)   ((REG) &= ~(1 << (BIT)))
#define __NRF24L01_CHECK_BIT(REG, BIT)   (((REG) >> (BIT)) & 1)
#define __NRF24L01_MASK_BIT(REG, MASK)   ((REG) &= (MASK))

/* ----------------------- Define by compiler ---------------------- */
#if (defined(_CodeVISIONAVR__) || defined(__GNUC__)) && !defined(USE_HAL_DRIVER)
	
	#ifndef NRF24L01_GPIO_WritePin
		#define NRF24L01_GPIO_WritePin(gpiox , gpio_pin , pin_state)           GPIO_WritePin(&(gpiox) , (uint8_t)(gpio_pin) , pin_state)
	#endif
	
	#ifndef NRF24L01_GPIO_PIN_SET
		#define NRF24L01_GPIO_PIN_SET                                          _GPIO_PIN_SET
	#endif
	
	#ifndef NRF24L01_GPIO_PIN_RESET
		#define NRF24L01_GPIO_PIN_RESET                                        _GPIO_PIN_RESET
	#endif
	
	#ifndef NRF24L01_SPI_TransmitReceive
		#define NRF24L01_SPI_TransmitReceive(pTxData, pRxData, Size, Timeout)  SPI_TransmitReceive((pTxData), (pRxData), (Size), (Timeout))
		#define NRF24L01_SPI_Transmit(pTxData, Size, Timeout)                  SPI_Transmit((pTxData), (Size), (Timeout))
		#define NRF24L01_SPI_Receive(pRxData, Size, Timeout)                   SPI_Receive((pRxData), (Size), (Timeout))
	#endif
	
/*----------------------------------------------------------*/
#elif defined(USE_HAL_DRIVER)
	
	#ifndef NRF24L01_GPIO_WritePin
		#define NRF24L01_GPIO_WritePin(gpiox , gpio_pin , pin_state)           HAL_GPIO_WritePin((gpiox) , (uint32_t)(gpio_pin) , (pin_state))
	#endif
	
	#ifndef NRF24L01_GPIO_PIN_SET
		#define NRF24L01_GPIO_PIN_SET                                          GPIO_PIN_SET
	#endif
	
	#ifndef NRF24L01_GPIO_PIN_RESET
		#define NRF24L01_GPIO_PIN_RESET                                        GPIO_PIN_RESET
	#endif
		
