vjezxje/lib_rf_stm32f1/Rf_f4/Core/Inc/nrf24l01.h
	#ifndef NRF24L01_SPI_TransmitReceive
		#define NRF24L01_SPI_TransmitReceive(pTxData, pRxData, Size, Timeout)  HAL_SPI_TransmitReceive(&NRF24L01_SPI, (pTxData), (pRxData), (Size), (Timeout))
		#define NRF24L01_SPI_Transmit(pTxData, Size, Timeout)                  HAL_SPI_Transmit(&NRF24L01_SPI, (pTxData), (Size), (Timeout))
		#define NRF24L01_SPI_Receive(pRxData, Size, Timeout)                   HAL_SPI_Receive(&NRF24L01_SPI, (pRxData), (Size), (Timeout))
	#endif

#endif /* __GNUC__ */

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Types ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/* ----------------------- NRF24L01+ Commands ---------------------- */
typedef enum /* NRF24L01+ Command Type */
{
	
	NRF24L01_CMD_R_REGISTER         = 0b00000000,
	NRF24L01_CMD_W_REGISTER         = 0b00100000,
	NRF24L01_CMD_R_RX_PAYLOAD       = 0b01100001,
	NRF24L01_CMD_W_TX_PAYLOAD       = 0b10100000,
	NRF24L01_CMD_FLUSH_TX           = 0b11100001,
	NRF24L01_CMD_FLUSH_RX           = 0b11100010,
	NRF24L01_CMD_REUSE_TX_PL        = 0b11100011,
	NRF24L01_CMD_R_RX_PL_WID        = 0b01100000,
	NRF24L01_CMD_W_ACK_PAYLOAD      = 0b10101000,
	NRF24L01_CMD_W_TX_PAYLOAD_NOACK = 0b10110000,
	NRF24L01_CMD_NOP                = 0b11111111
	
}NRF24L01_CMDTypeDef;

/* ---------------------- NRF24L01 Register's ---------------------- */
typedef enum /* NRF24L01+ Registers */
{
	
	NRF24L01_REG_CONFIG      = 0x00,
	NRF24L01_REG_EN_AA       = 0x01,
	NRF24L01_REG_EN_RXADDR   = 0x02,
	NRF24L01_REG_SETUP_AW    = 0x03,
	NRF24L01_REG_SETUP_RETR  = 0x04,
	NRF24L01_REG_RF_CH       = 0x05,
	NRF24L01_REG_RF_SETUP    = 0x06,
	NRF24L01_REG_STATUS      = 0x07,
	NRF24L01_REG_OBSERVE_TX  = 0x08, // Read-Only
	NRF24L01_REG_RPD         = 0x09, // Read-Only
	NRF24L01_REG_RX_ADDR_P0  = 0x0A,
	NRF24L01_REG_RX_ADDR_P1  = 0x0B,
	NRF24L01_REG_RX_ADDR_P2  = 0x0C,
	NRF24L01_REG_RX_ADDR_P3  = 0x0D,
	NRF24L01_REG_RX_ADDR_P4  = 0x0E,
	NRF24L01_REG_RX_ADDR_P5  = 0x0F,
	NRF24L01_REG_TX_ADDR     = 0x10,
	NRF24L01_REG_RX_PW_P0    = 0x11,
	NRF24L01_REG_RX_PW_P1    = 0x12,
	NRF24L01_REG_RX_PW_P2    = 0x13,
	NRF24L01_REG_RX_PW_P3    = 0x14,
	NRF24L01_REG_RX_PW_P4    = 0x15,
	NRF24L01_REG_RX_PW_P5    = 0x16,
	NRF24L01_REG_FIFO_STATUS = 0x17,
	NRF24L01_REG_DYNPD       = 0x1C,
	NRF24L01_REG_FEATURE     = 0x1D
	
}NRF24L01_RegTypeDef;

typedef enum /* NRF24L01+ Default Registers Value */
{
	
	NRF24L01_REG_DEF_CONFIG      = 0x08,
	NRF24L01_REG_DEF_EN_AA       = 0x3F,
	NRF24L01_REG_DEF_EN_RXADDR   = 0x03,
	NRF24L01_REG_DEF_SETUP_AW    = 0x03,
	NRF24L01_REG_DEF_SETUP_RETR  = 0x03,
	NRF24L01_REG_DEF_RF_CH       = 0x02,
	NRF24L01_REG_DEF_RF_SETUP    = 0x07,
	NRF24L01_REG_DEF_STATUS      = 0x7E,
	NRF24L01_REG_DEF_RX_ADDR_P0  = 0xE7,
	NRF24L01_REG_DEF_RX_ADDR_P1  = 0xC2,
	NRF24L01_REG_DEF_RX_ADDR_P2  = 0xC3,
	NRF24L01_REG_DEF_RX_ADDR_P3  = 0xC4,
	NRF24L01_REG_DEF_RX_ADDR_P4  = 0xC5,
	NRF24L01_REG_DEF_RX_ADDR_P5  = 0xC6,
	NRF24L01_REG_DEF_RX_PW_P0_P5 = 0x00,
	NRF24L01_REG_DEF_FIFO_STATUS = 0x11,
	NRF24L01_REG_DEF_DYNPD       = 0x00,
	NRF24L01_REG_DEF_FEATURE     = 0x00
	
}NRF24L01_RegRSTValTypeDef;

typedef enum /* NRF24L01+ Register bit's */
{
	
	NRF24L01_RX_DR               = 6,
	NRF24L01_TX_DS               = 5,
	NRF24L01_TX_DS_MASK          = 0x20,
	NRF24L01_MAX_RT              = 4,

	/* Config Register */
	NRF24L01_PRIM_RX             = 0,
	NRF24L01_PWR_UP              = 1,
	NRF24L01_CRCO                = 2,
	NRF24L01_CRCO_MASK_RST       = 0xFB,
	NRF24L01_EN_CRC              = 3,

	NRF24L01_ARC                 = 0,
	NRF24L01_ARC_MASK_RST        = 0xF0,
	NRF24L01_ARD                 = 4,
	NRF24L01_ARD_BIT_MASK_RST    = 0x0F,
	NRF24L01_RF_PWR              = 1,
	NRF24L01_RF_PWR_BIT_MASK_RST = 0xF9,
	NRF24L01_RF_DR_BIT_MASK_RST  = 0xD7,


	/* Enable Auto Acknowledgment */
	NRF24L01_ENAA_P5 = 5,
	NRF24L01_ENAA_P4 = 4,
	NRF24L01_ENAA_P3 = 3,
	NRF24L01_ENAA_P2 = 2,
	NRF24L01_ENAA_P1 = 1,
	NRF24L01_ENAA_P0 = 0,

	/* Enable Rx Addresses */
	NRF24L01_ERX_P5 = 5,
	NRF24L01_ERX_P4 = 4,
	NRF24L01_ERX_P3 = 3,
	NRF24L01_ERX_P2 = 2,
	NRF24L01_ERX_P1 = 1,
	NRF24L01_ERX_P0 = 0,
	
}NRF24L01_RegBitTypeDef;

/* ---------------------- NRF24L01 Parameter's --------------------- */
typedef enum /* NRF24L01+ Data Rate */
{
	
	NRF24L01_DATA_RATE_1MBPS   = 0,
	NRF24L01_DATA_RATE_2MBPS   = 1,
	NRF24L01_DATA_RATE_250KBPS = 2,
	
}NRF24L01_DataRateTypeDef;

typedef enum /* NRF24L01+ Output Power */
{
	
	NRF24L01_PWR_0DBM  = 3,
	NRF24L01_PWR_6DBM  = 2,
	NRF24L01_PWR_12DBM = 1,
	NRF24L01_PWR_18DBM = 0

}NRF24L01_PWRTypeDef;

typedef enum /* NRF24L01+ Enable Auto ACK */
{

	NRF24L01_AUTO_ACK_P0  = 0x01,
	NRF24L01_AUTO_ACK_P1  = 0x02,
	NRF24L01_AUTO_ACK_P2  = 0x04,
	NRF24L01_AUTO_ACK_P3  = 0x08,
	NRF24L01_AUTO_ACK_P4  = 0x10,
	NRF24L01_AUTO_ACK_P5  = 0x20,
	NRF24L01_AUTO_ACK_ALL = 0x3F,

}NRF24L01_AutoACKTypeDef;

typedef enum /* NRF24L01+ Enable Rx Addresses */
{

	NRF24L01_RX_ADDRESS_P0  = 0x01,
	NRF24L01_RX_ADDRESS_P1  = 0x02,
	NRF24L01_RX_ADDRESS_P2  = 0x04,
	NRF24L01_RX_ADDRESS_P3  = 0x08,
	NRF24L01_RX_ADDRESS_P4  = 0x10,
	NRF24L01_RX_ADDRESS_P5  = 0x20,
	NRF24L01_RX_ADDRESS_ALL = 0x3F,

}NRF24L01_RxAddTypeDef;

typedef enum /* NRF24L01+ States */
{

	NRF24L01_DISABLE = 0,
	NRF24L01_ENABLE  = 1
	
}NRF24L01_StateTypeDef;

/* ---------------------------- Common ----------------------------- */

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Variables ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Enum ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Struct ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Prototype ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
/* ......................... Initialize ........................ */
/*
 * Function: NRF24L01_RxInit
 * -------------------------
 * Initialize NRF24L01 as receiver
 *
 * Param  : 
 *         Channel  : RF Channel Frequency (1 to 125)
 *         DataRate : RF Air Data Rate (1 or 2Mbps)
 *         Timeout  : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_RxInit(100, NRF24L01_DATA_RATE_1MBPS, 1000);
 *         ...
 *         
 */
void NRF24L01_RxInit(uint8_t Channel, NRF24L01_DataRateTypeDef DataRate, uint16_t Timeout);

