vjezxje/lib_rf_stm32f1/Rf_f4/Core/Inc/nrf24l01.h
/*
 * Function: NRF24L01_TxInit
 * -------------------------
 * Initialize NRF24L01 as transmitter
 *
 * Param  : 
 *         Channel  : RF Channel Frequency (1 to 125)
 *         DataRate : RF Air Data Rate (1 or 2Mbps)
 *         Timeout  : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_TxInit(100, NRF24L01_DATA_RATE_1MBPS, 1000);
 *         ...
 *         
 */
void NRF24L01_TxInit(uint8_t Channel, NRF24L01_DataRateTypeDef DataRate, uint16_t Timeout);

/* .......................... Control .......................... */
/*
 * Function: NRF24L01_Reset
 * ------------------------
 * Reset NRF24L01
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_Reset(1000);
 *         ...
 *         
 */
void NRF24L01_Reset(uint16_t Timeout);

/* ........................ Primary Mode ....................... */
/*
 * Function: NRF24L01_PRxMode
 * --------------------------
 * Set NRF24L01 Primary Mode as Rx
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_PRxMode(1000);
 *         ...
 *         
 */
void NRF24L01_PRxMode(uint16_t Timeout);

/*
 * Function: NRF24L01_PTxMode
 * --------------------------
 * Set NRF24L01 Primary Mode as Tx
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_PTxMode(1000);
 *         ...
 *         
 */
void NRF24L01_PTxMode(uint16_t Timeout);

/* ...................... Transmit/Receive ..................... */
/*
 * Function: NRF24L01_RxReceive
 * ----------------------------
 * Read receive data from NRF24L01
 *
 * Param  : 
 *         pRxPayload      : Pointer to reception data buffer
 *         RxPayloadNumber : Pointer to receiver number (Data Pipe x)
 *         Timeout         : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         uint8_t RxNumber;
 *         uint8_t DataBuffer[NRF24L01_PAYLOAD_LENGTH];
 *         
 *         NRF24L01_RxReceive(DataBuffer, &RxNumber, 1000);
 *         ...
 *         
 */
void NRF24L01_RxReceive(uint8_t *pRxPayload, uint8_t *RxPayloadNumber, uint16_t Timeout);

/*
 * Function: NRF24L01_TxTransmit
 * -----------------------------
 * Send data with NRF24L01
 *
 * Param  : 
 *         pTxPayload : Pointer to transmission data buffer
 *         Timeout    : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         uint8_t DataBuffer[NRF24L01_PAYLOAD_LENGTH] = "HelloNRF";
 *         
 *         NRF24L01_TxTransmit(DataBuffer, 1000);
 *         ...
 *         
 */
void NRF24L01_TxTransmit(uint8_t* pTxPayload, uint16_t Timeout);

/* Rx/Tx Status Control */
/*
 * Function: NRF24L01_ClearRxDR
 * ----------------------------
 * Clear NRF24L01 Rx Data Transmit flag
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_ClearRxDR(1000);
 *         ...
 *         
 */
void NRF24L01_ClearRxDR(uint16_t Timeout);

/*
 * Function: NRF24L01_ClearTxDS
 * ----------------------------
 * Clear NRF24L01 Tx Data Sent flag
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_ClearTxDS(1000);
 *         ...
 *         
 */
void NRF24L01_ClearTxDS(uint16_t Timeout);

/*
 * Function: NRF24L01_ClearMaxRT
 * -----------------------------
 * Clear NRF24L01 MaxRT flag
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_ClearMaxRT(1000);
 *         ...
 *         
 */
void NRF24L01_ClearMaxRT(uint16_t Timeout);

/* ........................ FIFO Control ....................... */
/* Read/Write */
/*
 * Function: NRF24L01_ReadRxFIFO
 * -----------------------------
 * Read receive data from NRF24L01 FIFO
 *
 * Param  : 
 *         pRxPayload : Pointer to reception data buffer
 *         Timeout    : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         uint8_t DataBuffer[NRF24L01_PAYLOAD_LENGTH];
 *         
 *         NRF24L01_ReadRxFIFO(DataBuffer, 1000);
 *         ...
 *         
 */
uint8_t NRF24L01_ReadRxFIFO(uint8_t *pRxPayload, uint16_t Timeout);

/*
 * Function: NRF24L01_WriteTxFIFO
 * ------------------------------
 * Write data to NRF24L01 FIFO to transmit
 *
 * Param  : 
 *         pTxPayload : Pointer to transmission data buffer
 *         Timeout    : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         uint8_t DataBuffer[NRF24L01_PAYLOAD_LENGTH] = "HelloNRF";
 *         
 *         NRF24L01_WriteTxFIFO(DataBuffer, 1000);
 *         ...
 *         
 */
uint8_t NRF24L01_WriteTxFIFO(uint8_t *pTxPayload, uint16_t Timeout);

/* Flush */
/*
 * Function: NRF24L01_FlushRxFIFO
 * ------------------------------
 * Flush the NRF24L01 Rx FIFO
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_FlushRxFIFO(1000);
 *         ...
 *         
 */
void NRF24L01_FlushRxFIFO(uint16_t Timeout);

/*
 * Function: NRF24L01_FlushTxFIFO
 * ------------------------------
 * Flush the NRF24L01 Tx FIFO
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_FlushTxFIFO(1000);
 *         ...
 *         
 */
void NRF24L01_FlushTxFIFO(uint16_t Timeout);

/* Status */
/*
 * Function: NRF24L01_GetFIFOStatus
 * --------------------------------
 * Get the NRF24L01 FIFO status
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         FIFO Status : FIFO Status Register value
 *         
 * Example: 
 *         uint8_t Status;
 *
 *         Status = NRF24L01_GetFIFOStatus(1000);
 *         ...
 *         
 */
uint8_t NRF24L01_GetFIFOStatus(uint16_t Timeout);

/* ........................... Power ........................... */
/*
 * Function: NRF24L01_PowerUp
 * --------------------------
 * Power Up the NRF24L01
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_PowerUp(1000);
 *         ...
 *         
 */
void NRF24L01_PowerUp(uint16_t Timeout);

