vjezxje/lib_rf_stm32f1/Rf_f4/Core/Inc/nrf24l01.h
/*
 * Function: NRF24L01_PowerDown
 * ----------------------------
 * Power Down the NRF24L01
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_PowerDown(1000);
 *         ...
 *         
 */
void NRF24L01_PowerDown(uint16_t Timeout);

/* ......................... RF Address ........................ */
/*
 * Function: NRF24L01_EnableRxAddress
 * ----------------------------------
 * Enable the NRF24L01 Rx Addresses
 *
 * Param  : 
 *         RxAddress : Rx Data Pipe 0 to 5 (NRF24L01_RX_ADDRESS_x)
 *         Timeout   : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_EnableRxAddress(NRF24L01_RX_ADDRESS_P0, 1000);
 *         NRF24L01_EnableRxAddress(NRF24L01_RX_ADDRESS_ALL, 1000);
 *         ...
 *         
 */
void NRF24L01_EnableRxAddress(NRF24L01_RxAddTypeDef RxAddress, uint16_t Timeout);

/*
 * Function: NRF24L01_DisableRxAddress
 * -----------------------------------
 * Disable the NRF24L01 Rx Addresses
 *
 * Param  : 
 *         RxAddress : Rx Data Pipe 0 to 5 (NRF24L01_RX_ADDRESS_x)
 *         Timeout   : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_DisableRxAddress(NRF24L01_RX_ADDRESS_P0, 1000);
 *         NRF24L01_DisableRxAddress(NRF24L01_RX_ADDRESS_ALL, 1000);
 *         ...
 *         
 */
void NRF24L01_DisableRxAddress(NRF24L01_RxAddTypeDef RxAddress, uint16_t Timeout);

/*
 * Function: NRF24L01_SetAddressWidths
 * -----------------------------------
 * Set the NRF24L01 Rx/Tx Address Width
 *
 * Param  : 
 *         Width   : Width of Rx/Tx address (2 to 5 Byte)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetAddressWidths(5, 1000);
 *         ...
 *         
 */
void NRF24L01_SetAddressWidths(uint8_t Width, uint16_t Timeout);

/*
 * Function: NRF24L01_SetRxAddress
 * -------------------------------
 * Set the NRF24L01 Rx Addresses
 *
 * Param  : 
 *         RxAddress : Rx Data Pipe 0 to 5 (NRF24L01_RX_ADDRESS_x)
 *         Address   : Pointer to address, address 0~1 width is set by NRF24L01_SetAddressWidths, addresses 2 to 5 have only 1B
 *         Timeout   : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         uint8_t rxAdd0[5] = {0xB3, 0xB4, 0xB5, 0xB6, 0xCD};
 *         uint8_t rxAdd1[5] = {0x78, 0x78, 0x78, 0x78, 0x78};
 *         
 *         // Receive address data pipe 2 to 5. Only LSB. MSBytes will be equal to RX_ADDR_P1
 *         uint8_t rxAdd2 = 0xF3; // Address 2 is equal to {rxAdd1[0], rxAdd1[1], rxAdd1[2], rxAdd1[3], 0xF3}
 *         uint8_t rxAdd5 = 0xAB; // Address 5 is equal to {rxAdd1[0], rxAdd1[1], rxAdd1[2], rxAdd1[3], 0xAB}
 *         
 *         NRF24L01_SetRxAddress(NRF24L01_RX_ADDRESS_P0, rxAdd0, 1000);  // 0xB3, 0xB4, 0xB5, 0xB6, 0xCD
 *         NRF24L01_SetRxAddress(NRF24L01_RX_ADDRESS_P1, rxAdd1, 1000);  // 0x78, 0x78, 0x78, 0x78, 0x78
 *         NRF24L01_SetRxAddress(NRF24L01_RX_ADDRESS_P2, &rxAdd2, 1000); // 0x78, 0x78, 0x78, 0x78, 0xF3
 *         NRF24L01_SetRxAddress(NRF24L01_RX_ADDRESS_P5, &rxAdd5, 1000); // 0x78, 0x78, 0x78, 0x78, 0xAB
 *         ...
 *         
 */
void NRF24L01_SetRxAddress(NRF24L01_RxAddTypeDef RxAddress, uint8_t *Address, uint16_t Timeout);

/*
 * Function: NRF24L01_SetTxAddress
 * -------------------------------
 * Set the NRF24L01 Tx Address
 *
 * Param  : 
 *         Address : Pointer to address, address width is set by NRF24L01_SetAddressWidths
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         uint8_t txAdd[5] = {0xB3, 0xB4, 0xB5, 0xB6, 0xCD};
 *         
 *         NRF24L01_SetTxAddress(txAdd, 1000);  // 0xB3, 0xB4, 0xB5, 0xB6, 0xCD
 *         ...
 *         
 */
void NRF24L01_SetTxAddress(uint8_t *Address, uint16_t Timeout);

/* ......................... RF Control ........................ */
/*
 * Function: NRF24L01_SetRxPayloadWidths
 * -------------------------------------
 * Set the NRF24L01 Rx Payload Width (Data Packet Size)
 *
 * Param  : 
 *         Width   : Payload Width (1 to 32 Byte)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetRxPayloadWidths(8, 1000);
 *         ...
 *         
 */
void NRF24L01_SetRxPayloadWidths(uint8_t Width, uint16_t Timeout);

/*
 * Function: NRF24L01_SetCRCLength
 * -------------------------------
 * Set the NRF24L01 CRC Length
 *
 * Param  : 
 *         Length  : CRC Length (1 or 2 Byte)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetCRCLength(1, 1000);
 *         ...
 *         
 */
void NRF24L01_SetCRCLength(uint8_t Length, uint16_t Timeout);

/*
 * Function: NRF24L01_SetAutoACK
 * -----------------------------
 * Enable/Disable the NRF24L01 Auto Acknowledgment
 *
 * Param  : 
 *         AACK    : Auto Acknowledgment Data Pipe 0 to 5 (NRF24L01_AUTO_ACK_x)
 *         State   : State of Auto Acknowledgment (NRF24L01_DISABLE / NRF24L01_ENABLE)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetAutoACK(NRF24L01_AUTO_ACK_ALL, NRF24L01_DISABLE, 1000);
 *         NRF24L01_SetAutoACK(NRF24L01_AUTO_ACK_P0, NRF24L01_ENABLE, 1000);
 *         ...
 *         
 */
void NRF24L01_SetAutoACK(NRF24L01_AutoACKTypeDef AACK, NRF24L01_StateTypeDef State, uint16_t Timeout);

/*
 * Function: NRF24L01_AutoRetransmitCount
 * --------------------------------------
 * Set the NRF24L01 Auto Retransmit Count
 *
 * Param  : 
 *         Count   : Number of Retransmit (0 to 15 Re-Transmit on fail of AA)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_AutoRetransmitCount(10, 1000);
 *         ...
 *         
 */
void NRF24L01_AutoRetransmitCount(uint8_t Count, uint16_t Timeout);

