vjezxje/lib_rf_stm32f1/Rf_f4/Core/Inc/nrf24l01.h
/*
 * Function: NRF24L01_AutoRetransmitDelay
 * --------------------------------------
 * Set the NRF24L01 Auto Retransmit Delay Time (uS)
 *
 * Param  : 
 *         DelayTimeUS : Delay Time of Retransmit (2500 to 4000uS)
 *         Timeout     : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_AutoRetransmitDelay(2000, 1000);
 *         ...
 *         
 */
void NRF24L01_AutoRetransmitDelay(uint16_t DelayTimeUS, uint16_t Timeout);

/*
 * Function: NRF24L01_SetRFChannel
 * -------------------------------
 * Set the NRF24L01 RF Channel
 *
 * Param  : 
 *         Channel : Channel of RF Signal (0 to 125)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetRFChannel(100, 1000);
 *         ...
 *         
 */
void NRF24L01_SetRFChannel(uint8_t Channel, uint16_t Timeout);

/*
 * Function: NRF24L01_SetRFTxOutputPower
 * -------------------------------------
 * Set the NRF24L01 RF output power in Tx mode
 *
 * Param  : 
 *         dBm     : RF output power in Tx mode
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetRFTxOutputPower(NRF24L01_PWR_0DBM, 1000);
 *         ...
 *         
 */
void NRF24L01_SetRFTxOutputPower(NRF24L01_PWRTypeDef dBm, uint16_t Timeout);

/*
 * Function: NRF24L01_SetRFAirDataRate
 * -----------------------------------
 * Set the NRF24L01 RF Air Data Rate (Mbps)
 *
 * Param  : 
 *         bps     : Air Data Rate (Mbps)
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         -
 *         
 * Example: 
 *         NRF24L01_SetRFAirDataRate(NRF24L01_DATA_RATE_1MBPS, 1000);
 *         ...
 *         
 */
void NRF24L01_SetRFAirDataRate(NRF24L01_DataRateTypeDef bps, uint16_t Timeout);

/* ......................... IRQ Handle ........................ */
/*
 * Function: NRF24L01_TxIRQHandle
 * ------------------------------
 * NRF24L01 Tx IRQ handling
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         Status : Transmit status
 *         
 * Example: 
 *         ISR(EXTI0) // External Interrupt 0 is connected to NRF24L01 IRQ pin
 *         {
 *             NRF24L01_TxIRQHandle(100);
 *         }
 *         ...
 *         
 */
uint8_t NRF24L01_TxIRQHandle(uint16_t Timeout);

/* ............................................................. */
/*
 * Function: NRF24L01_GetStatus
 * ----------------------------
 * Get the NRF24L01 Status Register Value
 *
 * Param  : 
 *         Timeout : Timeout duration
 *         
 * Returns: 
 *         Status : Status Register value
 *         
 * Example: 
 *         uint8_t Status;
 *
 *         Status = NRF24L01_GetStatus(1000);
 *         ...
 *         
 */
uint8_t NRF24L01_GetStatus(uint16_t Timeout);

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ End of the program ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */
#endif /* __NRF24L01_H_ */
